



OSPF Working Group                                                 X. Xu
Internet-Draft                                               Alibaba Inc
Intended status: Standards Track                                 S. Kini
Expires: November 14, 2019
                                                               P. Psenak
                                                             C. Filsfils
                                                                   Cisco
                                                            S. Litkowski
                                                                  Orange
                                                            May 13, 2019


  Signaling Entropy Label Capability and Entropy Readable Label-stack
                            Depth Using OSPF
                      draft-ietf-ospf-mpls-elc-08

Abstract

   Multiprotocol Label Switching (MPLS) has defined a mechanism to load
   balance traffic flows using Entropy Labels (EL).  An ingress Label
   Switching Router (LSR) cannot insert ELs for packets going into a
   given tunnel unless an egress LSR has indicated via signaling that it
   has the capability of processing ELs, referred to as Entropy Label
   Capability (ELC), on that tunnel.  In addition, it would be useful
   for ingress LSRs to know each LSR's capability of reading the maximum
   label stack depth and performing EL-based load-balancing, referred to
   as Entropy Readable Label Depth (ERLD), in the cases where stacked
   LSPs are used.  This document defines a mechanisms to signal these
   two capabilities using OSPF and OSPFv3.  These mechanisms are
   particularly useful in the environment where Segment Routing (SR) is
   used, where label advertisements are done via protocols like OSPF and
   OSPFv3.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.



Xu, et al.              Expires November 14, 2019               [Page 1]

Internet-Draft     Signalling ELC and ERLD using OSPF           May 2019


   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on November 14, 2019.

Copyright Notice

   Copyright (c) 2019 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3
   3.  Advertising ELC Using OSPF  . . . . . . . . . . . . . . . . .   3
     3.1.  Advertising ELC Using OSPFv2  . . . . . . . . . . . . . .   4
     3.2.  Advertising ELC Using OSPFv3  . . . . . . . . . . . . . .   4
   4.  Advertising ERLD Using OSPF . . . . . . . . . . . . . . . . .   4
   5.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   4
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   4
   7.  Security Considerations . . . . . . . . . . . . . . . . . . .   5
   8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   5
     8.1.  Normative References  . . . . . . . . . . . . . . . . . .   5
     8.2.  Informative References  . . . . . . . . . . . . . . . . .   6
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   6

1.  Introduction

   [RFC6790] describes a method to load balance Multiprotocol Label
   Switching (MPLS) traffic flows using Entropy Labels (EL).  It also
   introduces the concept of Entropy Label Capability (ELC) and defines
   the signalings of this capability via MPLS signaling protocols.
   Recently, mechanisms are being defined to signal labels via link-
   state Interior Gateway Protocols (IGP) such as OSPF
   [I-D.ietf-ospf-segment-routing-extensions].  In such scenario, the
   signaling mechanisms defined in [RFC6790] are inadequate.  This draft



Xu, et al.              Expires November 14, 2019               [Page 2]

Internet-Draft     Signalling ELC and ERLD using OSPF           May 2019


   defines a mechanism to signal the ELC using OSPF.  This mechanism is
   useful when the label advertisement is also done via OSPF.

   In addition, in the cases where stacked LSPs are used for whatever
   reasons (e.g., SR-MPLS [I-D.ietf-spring-segment-routing-mpls]), it
   would be useful for ingress LSRs to know each intermediate LSR's
   capability of reading the maximum label stack depth and performing
   EL-based load-balancing.  This capability, referred to as Entropy
   Readable Label Depth (ERLD) as defined in
   [I-D.ietf-mpls-spring-entropy-label] may be used by ingress LSRs to
   determine whether it's necessary to insert an EL for a given LSP of
   the stacked LSP tunnel in the case where there has already been at
   least one EL in the label stack [I-D.ietf-mpls-spring-entropy-label].

2.  Terminology

   This memo makes use of the terms defined in [RFC6790] and [RFC7770].

3.  Advertising ELC Using OSPF

   Even though ELC is a property of the node, in some cases it is
   advantageous to associate and advertise the ELC with the prefix.  In
   multi-area network, routers may not know the identity of the prefix
   originator in the remote area, or may not know the capabilities of
   such originator.  Similarly in the multi domain network, the identity
   of the prefix originator and its capabilities may not be known to the
   ingress LSR.

   If a router has multiple line cards, the router MUST NOT announce ELC
   unless all of its linecards are capable of processing ELs.

   If the router support ELs on all of its line cards, it SHOULD
   advertise the ELC with every local host prefix it advertises in OSPF.

   When an OSPF Area Border Router (ABR) advertises the prefix to the
   connected area based on the intra-area or inter-area prefix that is
   reachable in some other area, it MUST preserve the ELC signalling for
   such prefix.

   When an OSPF Autonomous System Boundary Router (ASBR) redistributes
   the prefix from other instance of the OSPF or from some other
   protocol, it SHOULD preserve the ELC signalling for the prefix.
   Exact mechanism on how to exchange ELC between protocol instances on
   the ASBR is outside of the scope of this document and is
   implementation specific.






Xu, et al.              Expires November 14, 2019               [Page 3]

Internet-Draft     Signalling ELC and ERLD using OSPF           May 2019


3.1.  Advertising ELC Using OSPFv2

   [RFC7684] defines the OSPFv2 Extended Prefix TLV to advertise
   additional attributes associated with the prefix.  The OSPFv2
   Extended Prefix TLV includes a one octet Flags field.  A new bit in
   the Flags field is used to signal the ELC for the prefix:

      0x20 - E-Flag (ELC Flag): Set by the advertising router to
      indicate that the prefix originator is capable of processing ELs

3.2.  Advertising ELC Using OSPFv3

   [RFC5340] defines the OSPFv3 PrefixOptions that is advertised along
   with the prefix.  A new bit in the OSPFV3 PrefixOptions is used to
   signal the ELC for the prefix:

      0x04 - E-Flag (ELC Flag): Set by the advertising router to
      indicate that the prefix originator is capable of processing ELs

4.  Advertising ERLD Using OSPF

   A new MSD-type of the Node MSD sub-TLV
   [I-D.ietf-isis-segment-routing-msd], called ERLD is defined to
   advertise the ERLD of a given router.  The scope of the advertisement
   depends on the application.

   Assignment of a MSD-Type for ERLD is defined in
   [I-D.ietf-isis-mpls-elc].

   If a router has multiple linecards with different capabilities of
   reading the maximum label stack deepth, the router MUST advertise the
   smallest one.

5.  Acknowledgements

   The authors would like to thank Yimin Shen, George Swallow, Acee
   Lindem, Les Ginsberg, Ketan Talaulikar, Jeff Tantsura , Bruno
   Decraene and Carlos Pignataro for their valuable comments.

6.  IANA Considerations

   This document requests IANA to allocate one bit from the OSPFv2
   Extended Prefix TLV Flags registry:

      0x20 - E-Flag (ELC Flag)

   This document requests IANA to allocate one bit from the OSPFv3
   Prefix Options registry:



Xu, et al.              Expires November 14, 2019               [Page 4]

Internet-Draft     Signalling ELC and ERLD using OSPF           May 2019


      0x04 - E-Flag (ELC Flag)

7.  Security Considerations

   The security considerations as described in [RFC7770] is applicable
   to this document.  This document does not introduce any new security
   risk.

8.  References

8.1.  Normative References

   [I-D.ietf-isis-mpls-elc]
              Xu, X., Kini, S., Sivabalan, S., Filsfils, C., and S.
              Litkowski, "Signaling Entropy Label Capability and Entropy
              Readable Label Depth Using IS-IS", draft-ietf-isis-mpls-
              elc-06 (work in progress), September 2018.

   [I-D.ietf-isis-segment-routing-msd]
              Tantsura, J., Chunduri, U., Aldrin, S., and L. Ginsberg,
              "Signaling MSD (Maximum SID Depth) using IS-IS", draft-
              ietf-isis-segment-routing-msd-19 (work in progress),
              October 2018.

   [I-D.ietf-ospf-segment-routing-extensions]
              Psenak, P., Previdi, S., Filsfils, C., Gredler, H.,
              Shakir, R., Henderickx, W., and J. Tantsura, "OSPF
              Extensions for Segment Routing", draft-ietf-ospf-segment-
              routing-extensions-27 (work in progress), December 2018.

   [I-D.ietf-spring-segment-routing-mpls]
              Bashandy, A., Filsfils, C., Previdi, S., Decraene, B.,
              Litkowski, S., and R. Shakir, "Segment Routing with MPLS
              data plane", draft-ietf-spring-segment-routing-mpls-22
              (work in progress), May 2019.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC5305]  Li, T. and H. Smit, "IS-IS Extensions for Traffic
              Engineering", RFC 5305, DOI 10.17487/RFC5305, October
              2008, <https://www.rfc-editor.org/info/rfc5305>.

   [RFC5340]  Coltun, R., Ferguson, D., Moy, J., and A. Lindem, "OSPF
              for IPv6", RFC 5340, DOI 10.17487/RFC5340, July 2008,
              <https://www.rfc-editor.org/info/rfc5340>.



Xu, et al.              Expires November 14, 2019               [Page 5]

Internet-Draft     Signalling ELC and ERLD using OSPF           May 2019


   [RFC6790]  Kompella, K., Drake, J., Amante, S., Henderickx, W., and
              L. Yong, "The Use of Entropy Labels in MPLS Forwarding",
              RFC 6790, DOI 10.17487/RFC6790, November 2012,
              <https://www.rfc-editor.org/info/rfc6790>.

   [RFC7684]  Psenak, P., Gredler, H., Shakir, R., Henderickx, W.,
              Tantsura, J., and A. Lindem, "OSPFv2 Prefix/Link Attribute
              Advertisement", RFC 7684, DOI 10.17487/RFC7684, November
              2015, <https://www.rfc-editor.org/info/rfc7684>.

   [RFC7770]  Lindem, A., Ed., Shen, N., Vasseur, JP., Aggarwal, R., and
              S. Shaffer, "Extensions to OSPF for Advertising Optional
              Router Capabilities", RFC 7770, DOI 10.17487/RFC7770,
              February 2016, <https://www.rfc-editor.org/info/rfc7770>.

8.2.  Informative References

   [I-D.ietf-mpls-spring-entropy-label]
              Kini, S., Kompella, K., Sivabalan, S., Litkowski, S.,
              Shakir, R., and J. Tantsura, "Entropy label for SPRING
              tunnels", draft-ietf-mpls-spring-entropy-label-12 (work in
              progress), July 2018.

Authors' Addresses

   Xiaohu Xu
   Alibaba Inc

   Email: xiaohu.xxh@alibaba-inc.com


   Sriganesh Kini

   Email: sriganeshkini@gmail.com


   Peter Psenak
   Cisco

   Email: ppsenak@cisco.com


   Clarence Filsfils
   Cisco

   Email: cfilsfil@cisco.com





Xu, et al.              Expires November 14, 2019               [Page 6]

Internet-Draft     Signalling ELC and ERLD using OSPF           May 2019


   Stephane Litkowski
   Orange

   Email: stephane.litkowski@orange.com















































Xu, et al.              Expires November 14, 2019               [Page 7]
